-- Test Script For Showing Tips in the Loading Screen

qText =
{
" < ...через бездну пространства на Землю смотрели глазами, полными \n зависти,  существа с  высокоразвитым,  холодным,  бесчувственным\n интеллектом,  превосходящие  нас  настолько,  насколько  мы \n превосходим  вымерших  животных...>  \n                                                                     Г. Уэлс, <Война миров>  ",
" При покупке нового корабля, снимите со старого все оборудование, \nкроме двигателя, и продайте весь товар из грузового отсека. \nЕсли вы этого не сделаете, то просто потеряете и экипировку, и товар. ",
" <...фасеточные глаза, шарнирные конечности, антенны на голове,\nдвухрядные челюсти... Таргоиды! — эта мысль мгновенно \nродилась в его голове.  — Таргоиды, здесь на космической станции?!>\n\n                                                             Р. Холдсток, <Темное колесо> ",
" На Солнце в телескоп можно посмотреть дважды:\nодин раз левым глазом и один раз – правым…\n       \n                                                             Народная мудрость ",
" В космосе ничего не пропадает.\n \n                                              Станислав Лем ",
" <Поехали!>\n\nЮрий Алексеевич Гагарин - первый человек в космосе. ",
" <That's one small step  for man, one giant leap for mankind>.\n                                                           \n                                                                                 Neil Armstrong  ",
" <Это один маленький шаг для человека, \n         один гигантский прыжок для человечества>.\n                                                Нил Армстронг, \n                                                         первый землянин, \n                                                                        ступивший на Луну. ",
" Меня ужасает вечное безмолвие этих пространств.\n          \n                                                                                 Б. Паскаль ",
" В подсознании людей глубоко укоренилась мысль о том, что\nВселенная должна быть логичной. Но реальность всегда, \nхотя бы на шаг, уводит нас за пределы логики.\n\n                                                              Ф. Герберт, <Дюна>  ",
" <На пыльных тропинках далёких планет останутся наши следы!>  \n                                                                          \n                                                                  Отс Г.К., <Я верю друзья> ",
"\n Шпион-инопланетянин часто чувствует себя не в своей тарелке. \n      \n                                                                                             Анекдот ",
" Если летите в систему двойной или тройной звезды, то приготовьтесь \nк длительному полету, так как гипердрайв выкинет вас довольно далеко\nот цели из-за большой общей массы системы. ",
" И на Марсе будут яблони цвести, \nесли люди на Земле не наломают дров.\n                                        \n                                                             К. Кушнер ",
" Махнуть бы вокруг шарика!\n\n                                     Валерий Чкалов ",
" Неопровержимым доказательством существования\nразума на других планетах является то, что они никогда\nне пытались вступить в контакт с нами. ",
" Изучение космоса проходило бы быстрее, если\n бы учёные искали на планетах не воду, а спирт! ",
" Чем крупнее ваш корабль, тем проще в него попасть противнику. \nСледовательно, чем крупнее корабль противника, тем проще вам. ",
" Well done, Commander! ",
" <Я верю, друзья, караваны ракет \n                         помчат нас вперед от звезды до звезды...>  \n                                                                          \n                                                                  Отс Г.К., <Я верю друзья> ",
" Только после приземления космонавт чувствует себя на седьмом небе.\n    \n                                                                                         К. Кушнер ",
" Таргоиды были смертельно опасны. \nУ пилотов их кораблей удалялись железы, вырабатывающие\nвещества, которые вызывают чувство страха. \nЭто совершенно бесстрашные и безжалостные противники. \n                                                             Р. Холдсток, <Темное колесо> ",
" Земля - это колыбель разума, но нельзя вечно жить в колыбели.\n                                                                                        \n                                                                        Циолковский К.Э. ",
" ...нас ждут бездны открытий и мудрости. \nБудем жить, чтобы получить их и царствовать во Вселенной, \nподобно другим бессмертным.  \n            \n                                                                        Циолковский К.Э. ",
" Такова уж особенность звездного неба: \n у всякого, кто глядит на него, сладко щемит сердце. \n Возможно, мы и в самом деле родом откуда-то оттуда?\n \n                                                                                   Б. Акунин ",
" Вселенной глубоко безразличны индивидуальные помыслы, \nжелания, рассуждения... Жизнь чересчур коротка, существование\nлишено смысла, сама Вселенная не имеет цели.\n\n                                                     А.Д. Фостер, <Тропою славы> ",
" Герои и смельчаки проложат первые воздушные тропы трасс: \nЗемля — орбита Луны, Земля — орбита Марса и еще далее: \nМосква — Луна, Калуга — Марс \n                          \n                                                                        Циолковский К.Э. ",
" Чтобы стать крылатым, нужно стремление к полёту. \n                                                 \n                                                                          Гагарин Ю.А.  ",
" Космос ошибок не прощает. \n \n                                  Аксиома ",
" — Земля – не поляна для галактических пикников.\n\n                                                                              Man in Black ",
" Отдайте Галактику или уничтожим Землю. Извините. \n\n                                                                              Man in Black ",
" — Ты ведь знаешь, что Элвис умер?\n— Он не умер, он просто вернулся на свою планету.\n\n                                                                              Man in Black ",
" Но кто живет в этих мирах, если они обитаемы?.. \n Мы или они Владыки Мира?\n Разве все предназначено для человека?\n                                               \n                                 И. Кеплер (Р. Бертон, <Анатомия меланхолии>)  ",
" Твой отец искал следы мифической Раккслы. \nОн хотел узнать, существует ли она на самом деле? \nЕсли легенды не врут, то там должна быть установка, \nсозданная инопланетным разумом, с помощью которой\nоткрываются проходы в другие Вселенные, ко всем их сокровищам.\n                                                             Р. Холдсток, <Темное колесо> ",
"\n Шпион-инопланетянин часто чувствует себя не в своей тарелке. \n      \n                                                                                             Анекдот ",
" Нашел на лобовом стекле квитанцию о штрафе за\nпарковку в неположенном месте. \nПризнаков разумной жизни по-прежнему никаких. \n\n                                                                 Из бортжурнала ",
" Предоставленные автопилоту, события имеют\nтенденцию развиваться от плохого к худшему.\n\n                                                       Изречение одного пилота. ",
" Долететь до середины Галактики пилоту - раз плюнуть. \n Только что он там забыл?  ",
" Космос безмолвен, но крик о помощи услышит каждый.\n\n                                                          Р. Холдсток, <Темное колесо> ",
"\nПилот! Перед взлетом с космодрома не забудь запросить разрешение! ",
" Предоставленные автопилоту, события имеют\n тенденцию развиваться от плохого к худшему.\n\n                                                       Изречение одного пилота. "
}

quote = Randomize (1, 41);

lTip:showTip (qText[quote], 240, 860, ColorRGB (220, 240, 255));
